---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionIWideFlange
source: html/8a3783c4-23a2-e433-1186-506fa70508ab.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionIWideFlange

Defines parameters for I-shape Wide Flange structural section.

## Syntax (C#)
```csharp
public class StructuralSectionIWideFlange : StructuralSectionHotRolled
```